# ReplaceHalftoneWithThinLines Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PDFExportOptions..::..ReplaceHalftoneWithThinLines Property
PDFExportOptions Class See Also
---
Whether to replace halftone with thin lines.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public bool ReplaceHalftoneWithThinLines { get; set; }
```

Visual Basic
---
```text
Public Property ReplaceHalftoneWithThinLines As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool ReplaceHalftoneWithThinLines {
	bool get ();
	void set (bool value);
}
```

# See Also
PDFExportOptions Class
Autodesk.Revit.DB Namespace